---
kind: method
id: M:Autodesk.Revit.UI.ComboBox.AddSeparator
source: html/c52ae869-ff29-b9ce-9421-c5700e0daaba.htm
---
# Autodesk.Revit.UI.ComboBox.AddSeparator Method

Adds a separator to the drop-down list.

## Syntax (C#)
```csharp
public void AddSeparator()
```

## Remarks
The separator will be added below the last added member.